{
  "Apple___Apple_scab": {
    "Pesticides": "Captan,Mancozeb,Chlorothalonil,Sulfur,Neem Oil",
    "Fertilizers": "Nitrogen fertilizers (e.g., ammonium nitrate, urea),Phosphorus fertilizers (e.g., superphosphate),Potassium fertilizers (e.g., potassium sulfate, potassium chloride)",
    "Cultural Practices": ""
  },
  "Apple___Black_rot": {
    "Pesticides": "Captan,Mancozeb,Chlorothalonil,Sulfur,Neem Oil",
    "Fertilizers": "",
    "Cultural Practices": "Pruning,Sanitation (removing infected plant material),Mulching,Planting resistant varieties if available,Proper watering and avoiding overhead irrigation to reduce leaf wetness,Ensuring good air circulation around trees."
  },
  "Apple___Cedar_apple_rust": {
    "Pesticides": "Fungicides with Myclobutanil, copper, or sulfur",
    "Fertilizers": "",
    "Cultural Practices": "Pruning,Sanitation (removing infected plant material),Planting resistant varieties if available,Removing nearby cedar trees if possible to reduce the source of the rust spores,Applying fungicides preventatively, especially during periods of wet weather when spores are most likely to spread"
  },
  "Apple___healthy": {
    "Pesticides": "",
    "Fertilizers": "Balanced NPK fertilizers (containing nitrogen, phosphorus, and potassium),Slow-release organic fertilizers (e.g., compost, manure),Foliar fertilizers (applied directly to the leaves for quick absorption)",
    "Cultural Practices": "Proper watering,Mulching,Pruning,Pest and disease management,Soil management,Sunlight,Support,Winter protection"
  },
  "Blueberry___healthy": {
    "Pesticides": "",
    "Fertilizers": "Acidic fertilizers,Balanced NPK fertilizers,Slow-release organic fertilizers",
    "Cultural Practices": "Soil pH management,Mulching"
  },
  "Cherry_(including_sour)___Powdery_mildew": {
    "Pesticides": "Sulfur-based fungicides,Synthetic fungicides,Horticultural oils",
    "Fertilizers": "",
    "Cultural Practices": "Pruning,Sanitation"
  },
  "Cherry_(including_sour)___healthy": {
    "Pesticides": "",
    "Fertilizers": "Balanced NPK fertilizers,Slow-release organic fertilizers",
    "Cultural Practices": "Proper watering,Pruning"
  },
  "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot": {
    "Pesticides": "Triazole fungicides,Strobilurin fungicides,Multi-site fungicides",
    "Fertilizers": "",
    "Cultural Practices": "Crop rotation,Tillage,Planting resistant varieties"
  },
  "Corn_(maize)___Common_rust_": {
    "Pesticides": "Triazole fungicides: Propiconazole, Tebuconazole, Myclobutanil,Strobilurin fungicides: Azoxystrobin, Pyraclostrobin, Trifloxystrobin,Multi-site fungicides: Chlorothalonil, Mancozeb",
    "Fertilizers": "Balanced NPK fertilizers: Ammonium nitrate, Triple superphosphate, Potassium chloride,Micronutrient fertilizers: Zinc sulfate, Boron, Manganese sulfate",
    "Cultural Practices": "Crop rotation: Rotate corn with non-host crops to reduce pathogen buildup in the soil.,Tillage: Incorporate crop residues into the soil to accelerate decomposition and reduce pathogen survival.,Planting resistant varieties: Choose corn varieties with genetic resistance to common rust when available.,Proper spacing: Plant corn at recommended spacing to ensure good air circulation and reduce humidity levels.,Irrigation management: Avoid overhead irrigation to minimize leaf wetness and disease spread. Use drip or furrow irrigation to deliver water directly to the soil.,Weed control: Keep fields free of weeds, which can serve as alternate hosts for rust pathogens.,Crop residue management: Remove and destroy crop residues after harvest to reduce pathogen overwintering.,Monitoring: Regularly scout fields for common rust symptoms and take appropriate action based on severity and disease pressure.,Implementing a combination of these fertilizers, pesticides, and cultural practices can help effectively manage common rust in corn while promoting crop health and minimizing disease spread."
  },
  "Corn_(maize)___Northern_Leaf_Blight": {
    "Pesticides": "Triazole fungicides: Propiconazole, Tebuconazole, Myclobutanil,Strobilurin fungicides: Azoxystrobin, Pyraclostrobin, Trifloxystrobin,Multi-site fungicides: Chlorothalonil, Mancozeb",
    "Fertilizers": "Balanced NPK fertilizers: Ammonium nitrate, Triple superphosphate, Potassium chloride,Micronutrient fertilizers: Zinc sulfate, Boron, Manganese sulfate",
    "Cultural Practices": "Crop rotation: Rotate corn with non-host crops to reduce pathogen buildup in the soil.,Tillage: Incorporate crop residues into the soil to accelerate decomposition and reduce pathogen survival.,Planting resistant varieties: Choose corn varieties with genetic resistance to Northern Leaf Blight when available."
  },
  "Corn_(maize)___healthy": {
    "Pesticides": "Use herbicides to control weeds that compete with corn for nutrients, water, and sunlight. Examples include glyphosate, atrazine, and acetochlor.,Insecticides: Apply insecticides to manage insect pests such as corn rootworm, European corn borer, and corn earworm. Examples include bifenthrin, chlorpyrifos, and spinosad.,Fungicides: Use fungicides to prevent or control fungal diseases like Northern Leaf Blight, common rust, and gray leaf spot. Examples include azoxystrobin, propiconazole, and chlorothalonil.",
    "Fertilizers": "Balanced NPK fertilizers: Apply fertilizers containing nitrogen (N), phosphorus (P), and potassium (K) in balanced ratios according to soil test recommendations or general guidelines for corn.,Micronutrient fertilizers: Supplement with micronutrients like zinc, boron, and manganese as needed based on soil deficiencies or visual symptoms.",
    "Cultural Practices": "Crop rotation: Rotate corn with non-host crops to break pest and disease cycles and improve soil health.,Tillage: Practice appropriate tillage techniques to manage weeds, improve soil structure, and incorporate crop residues."
  },
  "Grape___Esca_(Black_Measles)": {
    "Pesticides": "Protective Fungicides: Apply protective fungicides early in the season before symptoms appear to prevent infection. Copper-based fungicides are often used in organic vineyards, while synthetic fungicides such as boscalid or folpet may be used in conventional vineyards.,Systemic Fungicides: Systemic fungicides like tebuconazole or azoxystrobin can be used to protect new growth from infection.",
    "Fertilizers": "Trunk Protectants: Apply a protective coating or paint to pruning wounds and vine cuts to prevent infection by wood decay fungi.,Canopy Management: Proper canopy management practices, including leaf removal and shoot positioning, can improve airflow and reduce humidity within the canopy, making the environment less favorable for Esca development.,Nutrient Management: Maintain balanced vine nutrition to promote plant health and vigor, as stressed vines are more susceptible to Esca.",
    "Cultural Practices": ""
  },
  "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": {
    "Pesticides": "Protective Fungicides: Apply protective fungicides early in the season before symptoms appear to prevent infection. Copper-based fungicides are often used in organic vineyards, while synthetic fungicides such as boscalid or folpet may be used in conventional vineyards.,Systemic Fungicides: Systemic fungicides like tebuconazole or azoxystrobin can be used to protect new growth from infection.",
    "Fertilizers": "Trunk Protectants: Apply a protective coating or paint to pruning wounds and vine cuts to prevent infection by wood decay fungi.,Canopy Management: Proper canopy management practices, including leaf removal and shoot positioning, can improve airflow and reduce humidity within the canopy, making the environment less favorable for Esca development.,Nutrient Management: Maintain balanced vine nutrition to promote plant health and vigor, as stressed vines are more susceptible to Esca.",
    "Cultural Practices": ""
  },
  "Grape___healthy": {
    "Pesticides": "",
    "Fertilizers": "",
    "Cultural Practices": "Plant grapevines at the proper spacing and orientation to optimize sunlight exposure and airflow.,Train vines onto trellises or arbors using appropriate training systems (e.g., vertical shoot positioning, Geneva Double Curtain) to support vine growth and facilitate management practices."
  },
  "Orange___Haunglongbing_(Citrus_greening)": {
    "Pesticides": "Insecticides: Apply systemic insecticides to control the Asian citrus psyllid, the vector of Huanglongbing. Common insecticides include neonicotinoids (e.g., imidacloprid, thiamethoxam) and insect growth regulators (e.g., pyriproxyfen).,Biological Control Agents: Use predatory insects such as ladybugs and lacewings, as well as parasitic wasps, to help control psyllid populations in an integrated pest management (IPM) approach.,Antibiotics: In regions with high disease pressure, antibiotics such as oxytetracycline and streptomycin may be used to suppress bacterial populations in infected trees. However, their efficacy is limited and should be used as part of a broader management strategy.",
    "Fertilizers": "Balanced NPK Fertilizers: Apply fertilizers containing nitrogen (N), phosphorus (P), and potassium (K) in balanced ratios according to soil test recommendations or citrus fertilization guidelines.,Micronutrients: Supplement with micronutrients like zinc, manganese, and iron as needed based on soil deficiencies or leaf analysis to optimize tree health.",
    "Cultural Practices": "Sanitation: Remove and destroy infected trees and control weeds to reduce the reservoir of the disease and its vector, the Asian citrus psyllid.,Pruning: Prune infected branches and remove symptomatic leaves to reduce disease spread within the tree and improve air circulation.,Nutrition: Maintain proper tree nutrition by applying balanced fertilization to promote overall tree health and resilience against the disease.,Water Management: Implement proper irrigation practices to avoid water stress, as stressed trees are more susceptible to infection.,Root Health: Ensure good root health through practices such as avoiding root damage during cultivation and ensuring proper drainage to prevent waterlogging."
  },
  "Peach___Bacterial_spot": {
    "Pesticides": "Copper-based Fungicides: Apply copper-based fungicides before bud break and throughout the growing season to help manage Bacterial Spot. Examples include copper hydroxide, copper sulfate, and Bordeaux mixture.,Streptomycin: In severe cases, antibiotics such as streptomycin may be used during bloom to suppress bacterial populations. However, their use should be judicious to minimize the risk of antibiotic resistance development.,Biological Control Agents: Some biological control agents, such as certain strains of Bacillus spp., may offer partial control of Bacterial Spot and can be integrated into an overall disease management strategy.",
    "Fertilizers": "Balanced NPK Fertilizers: Apply fertilizers with a balanced ratio of nitrogen (N), phosphorus (P), and potassium (K) according to soil test recommendations or peach fertilization guidelines.,Micronutrients: Supplement with micronutrients like zinc, copper, and manganese as needed based on soil deficiencies or leaf analysis to promote tree health and resilience against disease.",
    "Cultural Practices": "Sanitation: Remove and destroy infected plant parts, including leaves, twigs, and fruit, to reduce the pathogen's reservoir and minimize disease spread.,Pruning: Prune infected branches during the dormant season to improve air circulation within the canopy and remove diseased wood.,Spacing: Plant trees at appropriate spacing to promote airflow and reduce humidity within the canopy, which can help minimize disease development.,Irrigation: Avoid overhead irrigation to reduce leaf wetness and minimize disease spread. Use drip or soaker hose irrigation to deliver water directly to the root zone.,Weed Control: Keep the orchard floor free of weeds to reduce humidity and minimize the risk of disease spread.,Mulching: Apply mulch around the base of trees to suppress weeds, conserve moisture, and reduce soil splashing onto leaves and fruit."
  },
  "Peach___healthy": {
    "Pesticides": "Insecticides: Imidacloprid, Bifenthrin, Spinosad,Fungicides: Copper hydroxide, Chlorothalonil, Captan,Bactericides: Copper-based bactericides, Streptomycin",
    "Fertilizers": "Balanced NPK Fertilizers: 10-10-10, 20-20-20, 15-15-15,Micronutrients: Zinc sulfate, Manganese sulfate, Borax",
    "Cultural Practices": "Pruning: Regular pruning during the dormant season.,Thinning: Thinning out excess fruit to promote better growth.,Irrigation: Consistent irrigation practices to maintain soil moisture.,Weed Control: Mulching and manual removal of weeds.,Disease Prevention: Sanitation practices such as removing diseased plant parts.,Winter Protection: Use of frost blankets or burlap wraps during cold snaps."
  },
  "Pepper,_bell___Bacterial_spot": {
    "Pesticides": "Copper-based fungicides: Examples include copper hydroxide, copper sulfate, and Bordeaux mixture. These products help suppress bacterial populations and reduce disease spread.,Streptomycin: Antibiotic treatment may be used in severe cases to manage bacterial populations. However, it's essential to use antibiotics judiciously to minimize the risk of antibiotic resistance.",
    "Fertilizers": "Balanced NPK Fertilizers: Apply fertilizers containing balanced ratios of nitrogen (N), phosphorus (P), and potassium (K) to support plant health and resilience. Common formulations include 10-10-10 or 20-20-20.",
    "Cultural Practices": "Crop Rotation: Rotate pepper crops with non-host plants to break disease cycles and reduce pathogen pressure in the soil.,Sanitation: Remove and destroy infected plant debris to prevent the spread of bacteria. Clean tools and equipment between uses to avoid contamination.,Spacing: Plant peppers at recommended spacing to promote air circulation and reduce humidity, which can discourage bacterial growth."
  },
  "Pepper,_bell___healthy": {
    "Fertilizers": "Apply balanced fertilizers with a ratio of nitrogen (N), phosphorus (P), and potassium (K) suited to pepper plant needs. Common formulations include 10-10-10 or 20-20-20.,Supplement with micronutrients as needed, such as calcium, magnesium, and boron, to address specific deficiencies identified through soil testing or plant symptoms.",
    "Pesticides": "Insecticides: Use insecticides to manage common pests such as aphids, spider mites, and caterpillars, which can damage pepper plants and reduce yields. Options include neem oil, pyrethrin-based sprays, and insecticidal soap.,Fungicides: Apply fungicides preventatively to protect pepper plants from fungal diseases like powdery mildew and anthracnose. Products containing chlorothalonil, mancozeb, or copper-based compounds can be effective.",
    "Cultural Practices": "Crop Rotation: Rotate pepper crops with unrelated plants to break disease cycles and prevent nutrient depletion in the soil.,Spacing: Plant pepper seedlings at recommended spacing to ensure adequate airflow and sunlight penetration, which can help prevent disease and promote plant vigor.,Watering: Provide consistent moisture to pepper plants, ensuring they receive around 1-2 inches of water per week during the growing season. Avoid overwatering, as this can lead to root rot and other issues."
  },
  "Potato___Early_blight": {
    "Pesticides": "Fungicides: Apply fungicides to protect potato plants from Early Blight. Common fungicides used include: Chlorothalonil, Mancozeb, Copper-based fungicides, Azoxystrobin, Propiconazole, Follow label instructions carefully regarding application rates and timing. Apply fungicides preventatively before symptoms appear, especially during periods of high humidity or rainfall.",
    "Fertilizers": "Balanced NPK Fertilizers: Apply fertilizers with balanced ratios of nitrogen (N), phosphorus (P), and potassium (K) to support plant growth and vigor. Suitable formulations include 10-10-10 or 20-20-20.,Maintain adequate levels of soil fertility and pH to ensure healthy plant growth and resilience against diseases like Early Blight. Conduct soil tests to determine nutrient deficiencies and adjust fertilizer applications accordingly.",
    "Cultural Practices": "Crop Rotation: Rotate potato crops with non-host plants to break disease cycles and reduce pathogen buildup in the soil.,Sanitation: Remove and destroy infected plant debris, including infected leaves and stems, to reduce the spread of the disease.,Spacing: Plant potato seed pieces at recommended spacing to promote airflow and reduce humidity within the canopy, which can help minimize disease development.,Mulching: Apply organic mulch around potato plants to suppress weeds, conserve soil moisture, and prevent soil splashing, which can spread fungal spores."
  },
  "Potato___Late_blight": {
    "Pesticides": "Fungicides: Apply fungicides to protect potato plants from Late Blight. Common fungicides used include: Chlorothalonil, Mancozeb, Copper-based fungicides, Azoxystrobin, Metalaxyl, Follow label instructions carefully regarding application rates and timing. Apply fungicides preventatively before symptoms appear, especially during periods of high humidity or rainfall.",
    "Fertilizers": "Balanced NPK Fertilizers: Apply fertilizers with balanced ratios of nitrogen (N), phosphorus (P), and potassium (K) to support plant growth and vigor. Suitable formulations include 10-10-10 or 20-20-20.,Maintain adequate levels of soil fertility and pH to ensure healthy plant growth and resilience against diseases like Late Blight. Conduct soil tests to determine nutrient deficiencies and adjust fertilizer applications accordingly.",
    "Cultural Practices": "Crop Rotation: Rotate potato crops with non-host plants to break disease cycles and reduce pathogen buildup in the soil.,Sanitation: Remove and destroy infected plant debris, including infected leaves, stems, and tubers, to reduce the spread of the disease.,Spacing: Plant potato seed pieces at recommended spacing to promote airflow and reduce humidity within the canopy, which can help minimize disease development."
  },
  "Raspberry___healthy": {
    "Fertilizers": "Balanced NPK Fertilizers: Apply fertilizers with balanced ratios of nitrogen (N), phosphorus (P), and potassium (K) to support plant growth and fruit production. Consider using formulations like 10-10-10 or 20-20-20.,Apply fertilizers according to soil test recommendations or general guidelines for raspberry plants. Monitor plant growth and adjust fertilizer applications as needed throughout the growing season.",
    "Pesticides": "Insecticides: Use insecticides to manage common pests that can affect raspberry plants, such as aphids, spider mites, and raspberry fruitworms. Examples of insecticides include: Pyrethroids (e.g., permethrin), Neem oil, Insecticidal soap, Apply insecticides according to label instructions and timing based on pest presence and activity. Aim to target pests while minimizing harm to beneficial insects.,Cultural Practices: Site Selection: Choose a well-drained location with full sun exposure for planting raspberry bushes. Adequate sunlight and good air circulation help promote plant health and fruit development.,Soil Preparation: Prepare the soil before planting by incorporating organic matter such as compost or aged manure to improve soil structure, fertility, and drainage.,Planting: Plant raspberry bushes at the correct spacing and depth, following recommendations for the specific variety being planted. Proper planting ensures healthy root development and optimal growth.",
    "Cultural Practices": ""
  },
  "Soybean___healthy": {
    "Fertilizers": "Nitrogen Fixation: Soybeans have the ability to fix nitrogen from the atmosphere with the help of nitrogen-fixing bacteria (rhizobia) that form symbiotic relationships with their roots. Therefore, they generally require less nitrogen fertilizer compared to other crops.,Phosphorus and Potassium: Apply balanced fertilizers containing phosphorus (P) and potassium (K) according to soil test recommendations or general guidelines for soybeans. Common formulations include 10-20-20 or 15-15-15.,Micronutrients: Supplement with micronutrients such as boron, zinc, and manganese as needed based on soil deficiencies or crop symptoms.",
    "Pesticides": "Herbicides: Use herbicides to control weeds that compete with soybean plants for nutrients, water, and sunlight. Common herbicides used in soybean production include glyphosate, dicamba, and 2,4-D.,Insecticides: Monitor soybean fields for common pests such as soybean aphids, bean leaf beetles, and Japanese beetles. Apply insecticides if pest populations reach economic thresholds and pose a threat to yield.,Cultural Practices: Crop Rotation: Rotate soybean crops with non-host crops to break pest and disease cycles and improve soil health.,Planting Date: Plant soybeans at the appropriate time for your region to optimize growing conditions and avoid adverse weather during critical growth stages.,Row Spacing and Plant Population: Optimize row spacing and plant population density based on local recommendations and equipment capabilities to maximize yield potential.,Seed Treatment: Consider using seed treatments to protect soybean seeds from soilborne diseases and early-season insect pests.,Weed Management: Implement integrated weed management strategies, including herbicide applications, mechanical cultivation, and cover cropping, to minimize weed pressure and maintain crop competitiveness.",
    "Cultural Practices": ""
  },
  "Squash___Powdery_mildew": {
    "Pesticides": "Fungicides: Apply fungicides to prevent and control Powdery Mildew in squash plants. Common fungicides used include: Sulfur-based fungicides, Neem oil, Potassium bicarbonate, Fungicides containing active ingredients such as myclobutanil or azoxystrobin, Follow label instructions carefully regarding application rates, timing, and reapplication intervals. Apply fungicides preventatively and continue treatments throughout the growing season, especially during periods of high humidity.",
    "Fertilizers": "Balanced Fertilizers: Apply balanced fertilizers with a focus on potassium (K) to promote plant vigor and disease resistance. Potassium helps strengthen cell walls, making plants more resilient to Powdery Mildew infections.,Consider using fertilizers with low nitrogen (N) content, as excessive nitrogen can promote lush foliage growth, which may be more susceptible to Powdery Mildew.,Cultural Practices: Planting Site: Choose a well-drained location with good air circulation and plenty of sunlight for planting squash. Adequate sunlight and airflow can help reduce humidity and minimize Powdery Mildew development.,Spacing: Plant squash seeds or transplants at recommended spacing to promote airflow between plants and reduce leaf-to-leaf contact, which can facilitate disease spread.,Watering: Avoid overhead watering, as wet foliage can promote Powdery Mildew development.",
    "Cultural Practices": ""
  },
  "Strawberry___Leaf_scorch": {
    "Pesticides": "Fungicides: Apply fungicides to prevent and control Leaf Scorch in strawberry plants. Common fungicides used include: Copper-based fungicides, Captan, Chlorothalonil, Sulfur-based fungicides, Fungicides containing active ingredients such as azoxystrobin or myclobutanil, Follow label instructions carefully regarding application rates, timing, and reapplication intervals. Apply fungicides preventatively and continue treatments throughout the growing season, especially during periods of high humidity or when conditions are conducive to disease development.",
    "Fertilizers": "Balanced Fertilizers: Apply balanced fertilizers with a focus on potassium (K) to promote plant vigor and disease resistance. Potassium helps strengthen cell walls, making plants more resilient to Leaf Scorch infections.,Consider using slow-release or organic fertilizers to provide a steady supply of nutrients to strawberry plants without the risk of over-fertilization.,Cultural Practices: Planting Site: Choose a well-drained location with good air circulation and plenty of sunlight for planting strawberries. Proper site selection can help minimize conditions conducive to Leaf Scorch development.,Spacing: Plant strawberry runners or transplants at recommended spacing to promote airflow between plants and reduce leaf-to-leaf contact, which can facilitate disease spread.,Watering: Water strawberries at the base early in the day to allow foliage to dry quickly and minimize leaf wetness, which can promote Leaf Scorch development. Avoid overhead watering, as wet foliage can increase disease risk.",
    "Cultural Practices": ""
  },
  "Strawberry___healthy": {
    "Fertilizers": "Balanced Fertilizers: Apply balanced fertilizers with a focus on phosphorus (P) and potassium (K) to promote healthy root development, flowering, and fruit production. Phosphorus is particularly important for root growth, while potassium contributes to overall plant vigor and disease resistance.,Consider using slow-release or organic fertilizers to provide a steady supply of nutrients to strawberry plants without the risk of over-fertilization.,Monitor soil fertility through regular soil testing and adjust fertilizer applications accordingly to meet the plant's nutritional needs.",
    "Pesticides": "Insecticides: Use insecticides to manage common pests that can affect strawberry plants, such as aphids, spider mites, and strawberry root weevils. Examples of insecticides include: Pyrethroids (e.g., bifenthrin), Neem oil, Insecticidal soap, Apply insecticides according to label instructions and timing based on pest presence and activity. Aim to target pests while minimizing harm to beneficial insects.,Cultural Practices: Planting Site: Choose a well-drained location with full sun exposure for planting strawberries. Adequate sunlight promotes flowering and fruiting while reducing the risk of disease.,Soil Preparation: Prepare the soil before planting by incorporating organic matter such as compost or aged manure to improve soil structure, fertility, and drainage.,Planting: Plant strawberry runners or transplants at the correct depth and spacing, following recommendations for the specific variety being planted. Proper planting ensures healthy root establishment and optimal growth.",
    "Cultural Practices": ""
  },
  "Tomato___Bacterial_spot": {
    "Pesticides": "Copper-based fungicides: Copper-based products are commonly used to manage bacterial diseases like Bacterial Spot. Examples include copper hydroxide and copper sulfate. These can help suppress bacterial populations and reduce disease spread.,Streptomycin: Antibiotic treatments may be used in severe cases of Bacterial Spot to manage bacterial populations. However, its use should be judicious to minimize the risk of antibiotic resistance development.",
    "Fertilizers": "Balanced NPK Fertilizers: Apply fertilizers with balanced ratios of nitrogen (N), phosphorus (P), and potassium (K) to support plant health and resilience. Suitable formulations include 10-10-10 or 20-20-20.,Avoid excessive nitrogen fertilization, as it can promote lush foliage growth, which may be more susceptible to Bacterial Spot infections.",
    "Cultural Practices": "Crop Rotation: Rotate tomato crops with non-host plants to break disease cycles and reduce pathogen buildup in the soil.,Sanitation: Remove and destroy infected plant debris, including infected leaves, stems, and fruit, to reduce the spread of the disease.,Spacing: Plant tomato seedlings at recommended spacing to promote airflow between plants and reduce humidity within the canopy, which can help minimize disease development."
  },
  "Tomato___Early_blight": {
    "Pesticides": "Fungicides: Apply fungicides to protect tomato plants from Early Blight. Common fungicides used include: Chlorothalonil, Mancozeb, Copper-based fungicides, Azoxystrobin, Propiconazole, Follow label instructions carefully regarding application rates, timing, and reapplication intervals. Apply fungicides preventatively before symptoms appear, especially during periods of high humidity or rainfall.",
    "Fertilizers": "Balanced NPK Fertilizers: Apply fertilizers with balanced ratios of nitrogen (N), phosphorus (P), and potassium (K) to support plant growth and resilience against diseases like Early Blight. Suitable formulations include 10-10-10 or 20-20-20.,Maintain adequate levels of soil fertility and pH to ensure healthy plant growth and minimize stress. Conduct soil tests to determine nutrient deficiencies and adjust fertilizer applications accordingly.",
    "Cultural Practices": "Crop Rotation: Rotate tomato crops with non-host plants to break disease cycles and reduce pathogen buildup in the soil.,Sanitation: Remove and destroy infected plant debris, including affected leaves, stems, and fruit, to reduce the spread of the disease.,Spacing: Plant tomato seedlings at recommended spacing to promote airflow between plants and reduce humidity within the canopy, which can help minimize disease development."
  },
  "Tomato___Late_blight": {
    "Pesticides": "Fungicides: Apply fungicides to protect tomato plants from Late Blight. Common fungicides used include: Chlorothalonil, Mancozeb, Copper-based fungicides, Azoxystrobin, Metalaxyl",
    "Fertilizers": "Balanced NPK Fertilizers: Apply fertilizers with balanced ratios of nitrogen (N), phosphorus (P), and potassium (K) to support plant growth and resilience against diseases like Late Blight. Suitable formulations include 10-10-10 or 20-20-20.,Maintain adequate levels of soil fertility and pH to ensure healthy plant growth and minimize stress. Conduct soil tests to determine nutrient deficiencies and adjust fertilizer applications accordingly.",
    "Cultural Practices": "Crop Rotation: Rotate tomato crops with non-host plants to break disease cycles and reduce pathogen buildup in the soil.,Sanitation: Remove and destroy infected plant debris, including affected leaves, stems, and fruit, to reduce the spread of the disease.,Spacing: Plant tomato seedlings at recommended spacing to promote airflow between plants and reduce humidity within the canopy, which can help minimize disease development.,Mulching: Apply organic mulch around tomato plants to suppress weeds, conserve soil moisture, and prevent soil splashing, which can spread fungal spores."
  },
  "Tomato___Leaf_Mold": {
    "Pesticides": "Fungicides: Apply fungicides to protect tomato plants from Late Blight. Common fungicides used include: Chlorothalonil, Mancozeb, Copper-based fungicides, Azoxystrobin, Metalaxyl",
    "Fertilizers": "Balanced NPK Fertilizers: Apply fertilizers with balanced ratios of nitrogen (N), phosphorus (P), and potassium (K) to support plant growth and resilience against diseases like Late Blight. Suitable formulations include 10-10-10 or 20-20-20.,Maintain adequate levels of soil fertility and pH to ensure healthy plant growth and minimize stress. Conduct soil tests to determine nutrient deficiencies and adjust fertilizer applications accordingly.",
    "Cultural Practices": "Crop Rotation: Rotate tomato crops with non-host plants to break disease cycles and reduce pathogen buildup in the soil.,Sanitation: Remove and destroy infected plant debris, including affected leaves, stems, and fruit, to reduce the spread of the disease.,Spacing: Plant tomato seedlings at recommended spacing to promote airflow between plants and reduce humidity within the canopy, which can help minimize disease development.,Mulching: Apply organic mulch around tomato plants to suppress weeds, conserve soil moisture, and prevent soil splashing, which can spread fungal spores."
  },
  "Tomato___Septoria_leaf_spot": {
    "Pesticides": "Apply fungicides to protect tomato plants from Late Blight. Common fungicides used include: Chlorothalonil, Mancozeb, Copper-based fungicides, Azoxystrobin, Metalaxyl",
    "Fertilizers": "Balanced NPK Fertilizers: Apply fertilizers with balanced ratios of nitrogen (N), phosphorus (P), and potassium (K) to support plant growth and resilience against diseases like Late Blight. Suitable formulations include 10-10-10 or 20-20-20.,Maintain adequate levels of soil fertility and pH to ensure healthy plant growth and minimize stress. Conduct soil tests to determine nutrient deficiencies and adjust fertilizer applications accordingly.",
    "Cultural Practices": "Crop Rotation: Rotate tomato crops with non-host plants to break disease cycles and reduce pathogen buildup in the soil.,Sanitation: Remove and destroy infected plant debris, including affected leaves, stems, and fruit, to reduce the spread of the disease.,Spacing: Plant tomato seedlings at recommended spacing to promote airflow between plants and reduce humidity within the canopy, which can help minimize disease development.,Mulching: Apply organic mulch around tomato plants to suppress weeds, conserve soil moisture, and prevent soil splashing, which can spread fungal spores."
  },
  "Tomato___Spider_mites Two-spotted_spider_mite": {
    "Pesticides": "Apply fungicides to protect tomato plants from Late Blight. Common fungicides used include: Chlorothalonil, Mancozeb, Copper-based fungicides, Azoxystrobin, Metalaxyl",
    "Fertilizers": "Balanced NPK Fertilizers: Apply fertilizers with balanced ratios of nitrogen (N), phosphorus (P), and potassium (K) to support plant growth and resilience against diseases like Late Blight. Suitable formulations include 10-10-10 or 20-20-20.,Maintain adequate levels of soil fertility and pH to ensure healthy plant growth and minimize stress. Conduct soil tests to determine nutrient deficiencies and adjust fertilizer applications accordingly.",
    "Cultural Practices": "Crop Rotation: Rotate tomato crops with non-host plants to break disease cycles and reduce pathogen buildup in the soil.,Sanitation: Remove and destroy infected plant debris, including affected leaves, stems, and fruit, to reduce the spread of the disease.,Spacing: Plant tomato seedlings at recommended spacing to promote airflow between plants and reduce humidity within the canopy, which can help minimize disease development.,Mulching: Apply organic mulch around tomato plants to suppress weeds, conserve soil moisture, and prevent soil splashing, which can spread fungal spores."
  },
  "Tomato___Target_Spot": {
    "Pesticides": "Apply fungicides to protect tomato plants from Late Blight. Common fungicides used include: Chlorothalonil, Mancozeb, Copper-based fungicides, Azoxystrobin, Metalaxyl",
    "Fertilizers": "Balanced NPK Fertilizers: Apply fertilizers with balanced ratios of nitrogen (N), phosphorus (P), and potassium (K) to support plant growth and resilience against diseases like Late Blight. Suitable formulations include 10-10-10 or 20-20-20.,Maintain adequate levels of soil fertility and pH to ensure healthy plant growth and minimize stress. Conduct soil tests to determine nutrient deficiencies and adjust fertilizer applications accordingly.",
    "Cultural Practices": "Crop Rotation: Rotate tomato crops with non-host plants to break disease cycles and reduce pathogen buildup in the soil.,Sanitation: Remove and destroy infected plant debris, including affected leaves, stems, and fruit, to reduce the spread of the disease.,Spacing: Plant tomato seedlings at recommended spacing to promote airflow between plants and reduce humidity within the canopy, which can help minimize disease development.,Mulching: Apply organic mulch around tomato plants to suppress weeds, conserve soil moisture, and prevent soil splashing, which can spread fungal spores."
  },
  "Tomato___Tomato_Yellow_Leaf_Curl_Virus": {
    "Pesticides": "Fungicides: Apply fungicides to protect tomato plants from Late Blight. Common fungicides used include: Chlorothalonil, Mancozeb, Copper-based fungicides, Azoxystrobin, Metalaxyl",
    "Fertilizers": "Balanced NPK Fertilizers: Apply fertilizers with balanced ratios of nitrogen (N), phosphorus (P), and potassium (K) to support plant growth and resilience against diseases like Late Blight. Suitable formulations include 10-10-10 or 20-20-20.,Maintain adequate levels of soil fertility and pH to ensure healthy plant growth and minimize stress. Conduct soil tests to determine nutrient deficiencies and adjust fertilizer applications accordingly.",
    "Cultural Practices": "Crop Rotation: Rotate tomato crops with non-host plants to break disease cycles and reduce pathogen buildup in the soil.,Sanitation: Remove and destroy infected plant debris, including affected leaves, stems, and fruit, to reduce the spread of the disease.,Spacing: Plant tomato seedlings at recommended spacing to promote airflow between plants and reduce humidity within the canopy, which can help minimize disease development.,Mulching: Apply organic mulch around tomato plants to suppress weeds, conserve soil moisture, and prevent soil splashing, which can spread fungal spores."
  },
  "Tomato___Tomato_mosaic_virus": {
    "Pesticides": "There are no chemical treatments available to cure or control Tomato Mosaic Virus. It's a viral disease, and fungicides are not effective against viruses. Some researchers have explored the potential of using antiviral compounds to reduce viral infections, but their efficacy and practicality in field settings are limited.",
    "Fertilizers": "Balanced NPK Fertilizers: Apply fertilizers with balanced ratios of nitrogen (N), phosphorus (P), and potassium (K) to support plant growth and resilience against diseases like Late Blight. Suitable formulations include 10-10-10 or 20-20-20.,Maintain adequate levels of soil fertility and pH to ensure healthy plant growth and minimize stress. Conduct soil tests to determine nutrient deficiencies and adjust fertilizer applications accordingly.",
    "Cultural Practices": "Crop Rotation: Rotate tomato crops with non-host plants to break disease cycles and reduce pathogen buildup in the soil.,Sanitation: Remove and destroy infected plant debris, including affected leaves, stems, and fruit, to reduce the spread of the disease.,Spacing: Plant tomato seedlings at recommended spacing to promote airflow between plants and reduce humidity within the canopy, which can help minimize disease development.,Mulching: Apply organic mulch around tomato plants to suppress weeds, conserve soil moisture, and prevent soil splashing, which can spread fungal spores."
  },
  "Tomato___healthy": {
    "Pesticides": "Apply fungicides to protect tomato plants from Late Blight. Common fungicides used include: Chlorothalonil, Mancozeb, Copper-based fungicides, Azoxystrobin, Metalaxyl",
    "Fertilizers": "Balanced NPK Fertilizers: Apply fertilizers with balanced ratios of nitrogen (N), phosphorus (P), and potassium (K) to support plant growth and resilience against diseases like Late Blight. Suitable formulations include 10-10-10 or 20-20-20.,Maintain adequate levels of soil fertility and pH to ensure healthy plant growth and minimize stress. Conduct soil tests to determine nutrient deficiencies and adjust fertilizer applications accordingly.",
    "Cultural Practices": "Crop Rotation: Rotate tomato crops with non-host plants to break disease cycles and reduce pathogen buildup in the soil.,Sanitation: Remove and destroy infected plant debris, including affected leaves, stems, and fruit, to reduce the spread of the disease.,Spacing: Plant tomato seedlings at recommended spacing to promote airflow between plants and reduce humidity within the canopy, which can help minimize disease development.,Mulching: Apply organic mulch around tomato plants to suppress weeds, conserve soil moisture, and prevent soil splashing, which can spread fungal spores."
  }
}
